espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_sd_reg.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** GPIOSD_SIGMADELTA0_REG register
 *  Duty Cycle Configure Register of SDM0
 */
#define GPIOSD_SIGMADELTA0_REG (DR_REG_GPIOSD_BASE + 0x0)
/** GPIOSD_SD0_IN : R/W; bitpos: [7:0]; default: 0;
 *  This field is used to configure the duty cycle of sigma delta modulation output.
 */
#define GPIOSD_SD0_IN    0x000000FFU
#define GPIOSD_SD0_IN_M  (GPIOSD_SD0_IN_V << GPIOSD_SD0_IN_S)
#define GPIOSD_SD0_IN_V  0x000000FFU
#define GPIOSD_SD0_IN_S  0
/** GPIOSD_SD0_PRESCALE : R/W; bitpos: [15:8]; default: 255;
 *  This field is used to set a divider value to divide APB clock.
 */
#define GPIOSD_SD0_PRESCALE    0x000000FFU
#define GPIOSD_SD0_PRESCALE_M  (GPIOSD_SD0_PRESCALE_V << GPIOSD_SD0_PRESCALE_S)
#define GPIOSD_SD0_PRESCALE_V  0x000000FFU
#define GPIOSD_SD0_PRESCALE_S  8

/** GPIOSD_SIGMADELTA1_REG register
 *  Duty Cycle Configure Register of SDM1
 */
#define GPIOSD_SIGMADELTA1_REG (DR_REG_GPIOSD_BASE + 0x4)
/** GPIOSD_SD0_IN : R/W; bitpos: [7:0]; default: 0;
 *  This field is used to configure the duty cycle of sigma delta modulation output.
 */
#define GPIOSD_SD0_IN    0x000000FFU
#define GPIOSD_SD0_IN_M  (GPIOSD_SD0_IN_V << GPIOSD_SD0_IN_S)
#define GPIOSD_SD0_IN_V  0x000000FFU
#define GPIOSD_SD0_IN_S  0
/** GPIOSD_SD0_PRESCALE : R/W; bitpos: [15:8]; default: 255;
 *  This field is used to set a divider value to divide APB clock.
 */
#define GPIOSD_SD0_PRESCALE    0x000000FFU
#define GPIOSD_SD0_PRESCALE_M  (GPIOSD_SD0_PRESCALE_V << GPIOSD_SD0_PRESCALE_S)
#define GPIOSD_SD0_PRESCALE_V  0x000000FFU
#define GPIOSD_SD0_PRESCALE_S  8

/** GPIOSD_SIGMADELTA2_REG register
 *  Duty Cycle Configure Register of SDM2
 */
#define GPIOSD_SIGMADELTA2_REG (DR_REG_GPIOSD_BASE + 0x8)
/** GPIOSD_SD0_IN : R/W; bitpos: [7:0]; default: 0;
 *  This field is used to configure the duty cycle of sigma delta modulation output.
 */
#define GPIOSD_SD0_IN    0x000000FFU
#define GPIOSD_SD0_IN_M  (GPIOSD_SD0_IN_V << GPIOSD_SD0_IN_S)
#define GPIOSD_SD0_IN_V  0x000000FFU
#define GPIOSD_SD0_IN_S  0
/** GPIOSD_SD0_PRESCALE : R/W; bitpos: [15:8]; default: 255;
 *  This field is used to set a divider value to divide APB clock.
 */
#define GPIOSD_SD0_PRESCALE    0x000000FFU
#define GPIOSD_SD0_PRESCALE_M  (GPIOSD_SD0_PRESCALE_V << GPIOSD_SD0_PRESCALE_S)
#define GPIOSD_SD0_PRESCALE_V  0x000000FFU
#define GPIOSD_SD0_PRESCALE_S  8

/** GPIOSD_SIGMADELTA3_REG register
 *  Duty Cycle Configure Register of SDM3
 */
#define GPIOSD_SIGMADELTA3_REG (DR_REG_GPIOSD_BASE + 0xc)
/** GPIOSD_SD0_IN : R/W; bitpos: [7:0]; default: 0;
 *  This field is used to configure the duty cycle of sigma delta modulation output.
 */
#define GPIOSD_SD0_IN    0x000000FFU
#define GPIOSD_SD0_IN_M  (GPIOSD_SD0_IN_V << GPIOSD_SD0_IN_S)
#define GPIOSD_SD0_IN_V  0x000000FFU
#define GPIOSD_SD0_IN_S  0
/** GPIOSD_SD0_PRESCALE : R/W; bitpos: [15:8]; default: 255;
 *  This field is used to set a divider value to divide APB clock.
 */
#define GPIOSD_SD0_PRESCALE    0x000000FFU
#define GPIOSD_SD0_PRESCALE_M  (GPIOSD_SD0_PRESCALE_V << GPIOSD_SD0_PRESCALE_S)
#define GPIOSD_SD0_PRESCALE_V  0x000000FFU
#define GPIOSD_SD0_PRESCALE_S  8

/** GPIOSD_SIGMADELTA4_REG register
 *  Duty Cycle Configure Register of SDM4
 */
#define GPIOSD_SIGMADELTA4_REG (DR_REG_GPIOSD_BASE + 0x10)
/** GPIOSD_SD0_IN : R/W; bitpos: [7:0]; default: 0;
 *  This field is used to configure the duty cycle of sigma delta modulation output.
 */
#define GPIOSD_SD0_IN    0x000000FFU
#define GPIOSD_SD0_IN_M  (GPIOSD_SD0_IN_V << GPIOSD_SD0_IN_S)
#define GPIOSD_SD0_IN_V  0x000000FFU
#define GPIOSD_SD0_IN_S  0
/** GPIOSD_SD0_PRESCALE : R/W; bitpos: [15:8]; default: 255;
 *  This field is used to set a divider value to divide APB clock.
 */
#define GPIOSD_SD0_PRESCALE    0x000000FFU
#define GPIOSD_SD0_PRESCALE_M  (GPIOSD_SD0_PRESCALE_V << GPIOSD_SD0_PRESCALE_S)
#define GPIOSD_SD0_PRESCALE_V  0x000000FFU
#define GPIOSD_SD0_PRESCALE_S  8

/** GPIOSD_SIGMADELTA5_REG register
 *  Duty Cycle Configure Register of SDM5
 */
#define GPIOSD_SIGMADELTA5_REG (DR_REG_GPIOSD_BASE + 0x14)
/** GPIOSD_SD0_IN : R/W; bitpos: [7:0]; default: 0;
 *  This field is used to configure the duty cycle of sigma delta modulation output.
 */
#define GPIOSD_SD0_IN    0x000000FFU
#define GPIOSD_SD0_IN_M  (GPIOSD_SD0_IN_V << GPIOSD_SD0_IN_S)
#define GPIOSD_SD0_IN_V  0x000000FFU
#define GPIOSD_SD0_IN_S  0
/** GPIOSD_SD0_PRESCALE : R/W; bitpos: [15:8]; default: 255;
 *  This field is used to set a divider value to divide APB clock.
 */
#define GPIOSD_SD0_PRESCALE    0x000000FFU
#define GPIOSD_SD0_PRESCALE_M  (GPIOSD_SD0_PRESCALE_V << GPIOSD_SD0_PRESCALE_S)
#define GPIOSD_SD0_PRESCALE_V  0x000000FFU
#define GPIOSD_SD0_PRESCALE_S  8

/** GPIOSD_SIGMADELTA6_REG register
 *  Duty Cycle Configure Register of SDM6
 */
#define GPIOSD_SIGMADELTA6_REG (DR_REG_GPIOSD_BASE + 0x18)
/** GPIOSD_SD0_IN : R/W; bitpos: [7:0]; default: 0;
 *  This field is used to configure the duty cycle of sigma delta modulation output.
 */
#define GPIOSD_SD0_IN    0x000000FFU
#define GPIOSD_SD0_IN_M  (GPIOSD_SD0_IN_V << GPIOSD_SD0_IN_S)
#define GPIOSD_SD0_IN_V  0x000000FFU
#define GPIOSD_SD0_IN_S  0
/** GPIOSD_SD0_PRESCALE : R/W; bitpos: [15:8]; default: 255;
 *  This field is used to set a divider value to divide APB clock.
 */
#define GPIOSD_SD0_PRESCALE    0x000000FFU
#define GPIOSD_SD0_PRESCALE_M  (GPIOSD_SD0_PRESCALE_V << GPIOSD_SD0_PRESCALE_S)
#define GPIOSD_SD0_PRESCALE_V  0x000000FFU
#define GPIOSD_SD0_PRESCALE_S  8

/** GPIOSD_SIGMADELTA7_REG register
 *  Duty Cycle Configure Register of SDM7
 */
#define GPIOSD_SIGMADELTA7_REG (DR_REG_GPIOSD_BASE + 0x1c)
/** GPIOSD_SD0_IN : R/W; bitpos: [7:0]; default: 0;
 *  This field is used to configure the duty cycle of sigma delta modulation output.
 */
#define GPIOSD_SD0_IN    0x000000FFU
#define GPIOSD_SD0_IN_M  (GPIOSD_SD0_IN_V << GPIOSD_SD0_IN_S)
#define GPIOSD_SD0_IN_V  0x000000FFU
#define GPIOSD_SD0_IN_S  0
/** GPIOSD_SD0_PRESCALE : R/W; bitpos: [15:8]; default: 255;
 *  This field is used to set a divider value to divide APB clock.
 */
#define GPIOSD_SD0_PRESCALE    0x000000FFU
#define GPIOSD_SD0_PRESCALE_M  (GPIOSD_SD0_PRESCALE_V << GPIOSD_SD0_PRESCALE_S)
#define GPIOSD_SD0_PRESCALE_V  0x000000FFU
#define GPIOSD_SD0_PRESCALE_S  8

/** GPIOSD_SIGMADELTA_MISC_REG register
 *  MISC Register
 */
#define GPIOSD_SIGMADELTA_MISC_REG (DR_REG_GPIOSD_BASE + 0x24)
/** GPIOSD_FUNCTION_CLK_EN : R/W; bitpos: [30]; default: 0;
 *  Clock enable bit of sigma delta modulation.
 */
#define GPIOSD_FUNCTION_CLK_EN    (BIT(30))
#define GPIOSD_FUNCTION_CLK_EN_M  (GPIOSD_FUNCTION_CLK_EN_V << GPIOSD_FUNCTION_CLK_EN_S)
#define GPIOSD_FUNCTION_CLK_EN_V  0x00000001U
#define GPIOSD_FUNCTION_CLK_EN_S  30
/** GPIOSD_SPI_SWAP : R/W; bitpos: [31]; default: 0;
 *  Reserved.
 */
#define GPIOSD_SPI_SWAP    (BIT(31))
#define GPIOSD_SPI_SWAP_M  (GPIOSD_SPI_SWAP_V << GPIOSD_SPI_SWAP_S)
#define GPIOSD_SPI_SWAP_V  0x00000001U
#define GPIOSD_SPI_SWAP_S  31

