espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_sd_reg.h
/** GPIOSD_GLITCH_FILTER_CH7_REG register
 *  Glitch Filter Configure Register of Channel7
 */
#define GPIOSD_GLITCH_FILTER_CH7_REG (DR_REG_GPIOSD_BASE + 0x4c)
/** GPIOSD_FILTER_CH0_EN : R/W; bitpos: [0]; default: 0;
 *  Glitch Filter channel enable bit.
 */
#define GPIOSD_FILTER_CH0_EN    (BIT(0))
#define GPIOSD_FILTER_CH0_EN_M  (GPIOSD_FILTER_CH0_EN_V << GPIOSD_FILTER_CH0_EN_S)
#define GPIOSD_FILTER_CH0_EN_V  0x00000001U
#define GPIOSD_FILTER_CH0_EN_S  0
/** GPIOSD_FILTER_CH0_INPUT_IO_NUM : R/W; bitpos: [6:1]; default: 0;
 *  Glitch Filter input io number.
 */
#define GPIOSD_FILTER_CH0_INPUT_IO_NUM    0x0000003FU
#define GPIOSD_FILTER_CH0_INPUT_IO_NUM_M  (GPIOSD_FILTER_CH0_INPUT_IO_NUM_V << GPIOSD_FILTER_CH0_INPUT_IO_NUM_S)
#define GPIOSD_FILTER_CH0_INPUT_IO_NUM_V  0x0000003FU
#define GPIOSD_FILTER_CH0_INPUT_IO_NUM_S  1
/** GPIOSD_FILTER_CH0_WINDOW_THRES : R/W; bitpos: [12:7]; default: 0;
 *  Glitch Filter window threshold.
 */
#define GPIOSD_FILTER_CH0_WINDOW_THRES    0x0000003FU
#define GPIOSD_FILTER_CH0_WINDOW_THRES_M  (GPIOSD_FILTER_CH0_WINDOW_THRES_V << GPIOSD_FILTER_CH0_WINDOW_THRES_S)
#define GPIOSD_FILTER_CH0_WINDOW_THRES_V  0x0000003FU
#define GPIOSD_FILTER_CH0_WINDOW_THRES_S  7
/** GPIOSD_FILTER_CH0_WINDOW_WIDTH : R/W; bitpos: [18:13]; default: 0;
 *  Glitch Filter window width.
 */
#define GPIOSD_FILTER_CH0_WINDOW_WIDTH    0x0000003FU
#define GPIOSD_FILTER_CH0_WINDOW_WIDTH_M  (GPIOSD_FILTER_CH0_WINDOW_WIDTH_V << GPIOSD_FILTER_CH0_WINDOW_WIDTH_S)
#define GPIOSD_FILTER_CH0_WINDOW_WIDTH_V  0x0000003FU
#define GPIOSD_FILTER_CH0_WINDOW_WIDTH_S  13

/** GPIOSD_ETM_EVENT_CH0_CFG_REG register
 *  Etm Config register of Channel0
 */
#define GPIOSD_ETM_EVENT_CH0_CFG_REG (DR_REG_GPIOSD_BASE + 0x60)
/** GPIOSD_ETM_CH0_EVENT_SEL : R/W; bitpos: [5:0]; default: 0;
 *  Etm event channel select gpio.
 */
#define GPIOSD_ETM_CH0_EVENT_SEL    0x0000003FU
#define GPIOSD_ETM_CH0_EVENT_SEL_M  (GPIOSD_ETM_CH0_EVENT_SEL_V << GPIOSD_ETM_CH0_EVENT_SEL_S)
#define GPIOSD_ETM_CH0_EVENT_SEL_V  0x0000003FU
#define GPIOSD_ETM_CH0_EVENT_SEL_S  0
/** GPIOSD_ETM_CH0_EVENT_EN : R/W; bitpos: [7]; default: 0;
 *  Etm event send enable bit.
 */
#define GPIOSD_ETM_CH0_EVENT_EN    (BIT(7))
#define GPIOSD_ETM_CH0_EVENT_EN_M  (GPIOSD_ETM_CH0_EVENT_EN_V << GPIOSD_ETM_CH0_EVENT_EN_S)
#define GPIOSD_ETM_CH0_EVENT_EN_V  0x00000001U
#define GPIOSD_ETM_CH0_EVENT_EN_S  7

/** GPIOSD_ETM_EVENT_CH1_CFG_REG register
 *  Etm Config register of Channel1
 */
#define GPIOSD_ETM_EVENT_CH1_CFG_REG (DR_REG_GPIOSD_BASE + 0x64)
/** GPIOSD_ETM_CH0_EVENT_SEL : R/W; bitpos: [5:0]; default: 0;
 *  Etm event channel select gpio.
 */
#define GPIOSD_ETM_CH0_EVENT_SEL    0x0000003FU
#define GPIOSD_ETM_CH0_EVENT_SEL_M  (GPIOSD_ETM_CH0_EVENT_SEL_V << GPIOSD_ETM_CH0_EVENT_SEL_S)
#define GPIOSD_ETM_CH0_EVENT_SEL_V  0x0000003FU
#define GPIOSD_ETM_CH0_EVENT_SEL_S  0
/** GPIOSD_ETM_CH0_EVENT_EN : R/W; bitpos: [7]; default: 0;
 *  Etm event send enable bit.
 */
#define GPIOSD_ETM_CH0_EVENT_EN    (BIT(7))
#define GPIOSD_ETM_CH0_EVENT_EN_M  (GPIOSD_ETM_CH0_EVENT_EN_V << GPIOSD_ETM_CH0_EVENT_EN_S)
#define GPIOSD_ETM_CH0_EVENT_EN_V  0x00000001U
#define GPIOSD_ETM_CH0_EVENT_EN_S  7

/** GPIOSD_ETM_EVENT_CH2_CFG_REG register
 *  Etm Config register of Channel2
 */
#define GPIOSD_ETM_EVENT_CH2_CFG_REG (DR_REG_GPIOSD_BASE + 0x68)
/** GPIOSD_ETM_CH0_EVENT_SEL : R/W; bitpos: [5:0]; default: 0;
 *  Etm event channel select gpio.
 */
#define GPIOSD_ETM_CH0_EVENT_SEL    0x0000003FU
#define GPIOSD_ETM_CH0_EVENT_SEL_M  (GPIOSD_ETM_CH0_EVENT_SEL_V << GPIOSD_ETM_CH0_EVENT_SEL_S)
#define GPIOSD_ETM_CH0_EVENT_SEL_V  0x0000003FU
#define GPIOSD_ETM_CH0_EVENT_SEL_S  0
/** GPIOSD_ETM_CH0_EVENT_EN : R/W; bitpos: [7]; default: 0;
 *  Etm event send enable bit.
 */
#define GPIOSD_ETM_CH0_EVENT_EN    (BIT(7))
#define GPIOSD_ETM_CH0_EVENT_EN_M  (GPIOSD_ETM_CH0_EVENT_EN_V << GPIOSD_ETM_CH0_EVENT_EN_S)
#define GPIOSD_ETM_CH0_EVENT_EN_V  0x00000001U
#define GPIOSD_ETM_CH0_EVENT_EN_S  7

/** GPIOSD_ETM_EVENT_CH3_CFG_REG register
 *  Etm Config register of Channel3
 */
#define GPIOSD_ETM_EVENT_CH3_CFG_REG (DR_REG_GPIOSD_BASE + 0x6c)
/** GPIOSD_ETM_CH0_EVENT_SEL : R/W; bitpos: [5:0]; default: 0;
 *  Etm event channel select gpio.
 */
#define GPIOSD_ETM_CH0_EVENT_SEL    0x0000003FU
#define GPIOSD_ETM_CH0_EVENT_SEL_M  (GPIOSD_ETM_CH0_EVENT_SEL_V << GPIOSD_ETM_CH0_EVENT_SEL_S)
#define GPIOSD_ETM_CH0_EVENT_SEL_V  0x0000003FU
#define GPIOSD_ETM_CH0_EVENT_SEL_S  0
/** GPIOSD_ETM_CH0_EVENT_EN : R/W; bitpos: [7]; default: 0;
 *  Etm event send enable bit.
 */
#define GPIOSD_ETM_CH0_EVENT_EN    (BIT(7))
#define GPIOSD_ETM_CH0_EVENT_EN_M  (GPIOSD_ETM_CH0_EVENT_EN_V << GPIOSD_ETM_CH0_EVENT_EN_S)
#define GPIOSD_ETM_CH0_EVENT_EN_V  0x00000001U
#define GPIOSD_ETM_CH0_EVENT_EN_S  7

/** GPIOSD_ETM_EVENT_CH4_CFG_REG register
 *  Etm Config register of Channel4
 */
#define GPIOSD_ETM_EVENT_CH4_CFG_REG (DR_REG_GPIOSD_BASE + 0x70)
/** GPIOSD_ETM_CH0_EVENT_SEL : R/W; bitpos: [5:0]; default: 0;
 *  Etm event channel select gpio.
 */
#define GPIOSD_ETM_CH0_EVENT_SEL    0x0000003FU
#define GPIOSD_ETM_CH0_EVENT_SEL_M  (GPIOSD_ETM_CH0_EVENT_SEL_V << GPIOSD_ETM_CH0_EVENT_SEL_S)
#define GPIOSD_ETM_CH0_EVENT_SEL_V  0x0000003FU
#define GPIOSD_ETM_CH0_EVENT_SEL_S  0
/** GPIOSD_ETM_CH0_EVENT_EN : R/W; bitpos: [7]; default: 0;
 *  Etm event send enable bit.
 */
#define GPIOSD_ETM_CH0_EVENT_EN    (BIT(7))
#define GPIOSD_ETM_CH0_EVENT_EN_M  (GPIOSD_ETM_CH0_EVENT_EN_V << GPIOSD_ETM_CH0_EVENT_EN_S)
#define GPIOSD_ETM_CH0_EVENT_EN_V  0x00000001U
#define GPIOSD_ETM_CH0_EVENT_EN_S  7

/** GPIOSD_ETM_EVENT_CH5_CFG_REG register
 *  Etm Config register of Channel5
 */
#define GPIOSD_ETM_EVENT_CH5_CFG_REG (DR_REG_GPIOSD_BASE + 0x74)
/** GPIOSD_ETM_CH0_EVENT_SEL : R/W; bitpos: [5:0]; default: 0;
 *  Etm event channel select gpio.
 */
#define GPIOSD_ETM_CH0_EVENT_SEL    0x0000003FU
#define GPIOSD_ETM_CH0_EVENT_SEL_M  (GPIOSD_ETM_CH0_EVENT_SEL_V << GPIOSD_ETM_CH0_EVENT_SEL_S)
#define GPIOSD_ETM_CH0_EVENT_SEL_V  0x0000003FU
#define GPIOSD_ETM_CH0_EVENT_SEL_S  0
/** GPIOSD_ETM_CH0_EVENT_EN : R/W; bitpos: [7]; default: 0;
 *  Etm event send enable bit.
 */
#define GPIOSD_ETM_CH0_EVENT_EN    (BIT(7))
#define GPIOSD_ETM_CH0_EVENT_EN_M  (GPIOSD_ETM_CH0_EVENT_EN_V << GPIOSD_ETM_CH0_EVENT_EN_S)
#define GPIOSD_ETM_CH0_EVENT_EN_V  0x00000001U
#define GPIOSD_ETM_CH0_EVENT_EN_S  7

/** GPIOSD_ETM_EVENT_CH6_CFG_REG register
 *  Etm Config register of Channel6
 */
#define GPIOSD_ETM_EVENT_CH6_CFG_REG (DR_REG_GPIOSD_BASE + 0x78)
/** GPIOSD_ETM_CH0_EVENT_SEL : R/W; bitpos: [5:0]; default: 0;
 *  Etm event channel select gpio.
 */
#define GPIOSD_ETM_CH0_EVENT_SEL    0x0000003FU
#define GPIOSD_ETM_CH0_EVENT_SEL_M  (GPIOSD_ETM_CH0_EVENT_SEL_V << GPIOSD_ETM_CH0_EVENT_SEL_S)
#define GPIOSD_ETM_CH0_EVENT_SEL_V  0x0000003FU
#define GPIOSD_ETM_CH0_EVENT_SEL_S  0
/** GPIOSD_ETM_CH0_EVENT_EN : R/W; bitpos: [7]; default: 0;
 *  Etm event send enable bit.
 */
#define GPIOSD_ETM_CH0_EVENT_EN    (BIT(7))
#define GPIOSD_ETM_CH0_EVENT_EN_M  (GPIOSD_ETM_CH0_EVENT_EN_V << GPIOSD_ETM_CH0_EVENT_EN_S)
#define GPIOSD_ETM_CH0_EVENT_EN_V  0x00000001U
#define GPIOSD_ETM_CH0_EVENT_EN_S  7

/** GPIOSD_ETM_EVENT_CH7_CFG_REG register
 *  Etm Config register of Channel7
 */
#define GPIOSD_ETM_EVENT_CH7_CFG_REG (DR_REG_GPIOSD_BASE + 0x7c)
/** GPIOSD_ETM_CH0_EVENT_SEL : R/W; bitpos: [5:0]; default: 0;
 *  Etm event channel select gpio.
 */
#define GPIOSD_ETM_CH0_EVENT_SEL    0x0000003FU
#define GPIOSD_ETM_CH0_EVENT_SEL_M  (GPIOSD_ETM_CH0_EVENT_SEL_V << GPIOSD_ETM_CH0_EVENT_SEL_S)
#define GPIOSD_ETM_CH0_EVENT_SEL_V  0x0000003FU
#define GPIOSD_ETM_CH0_EVENT_SEL_S  0
/** GPIOSD_ETM_CH0_EVENT_EN : R/W; bitpos: [7]; default: 0;
 *  Etm event send enable bit.
 */
#define GPIOSD_ETM_CH0_EVENT_EN    (BIT(7))
#define GPIOSD_ETM_CH0_EVENT_EN_M  (GPIOSD_ETM_CH0_EVENT_EN_V << GPIOSD_ETM_CH0_EVENT_EN_S)
#define GPIOSD_ETM_CH0_EVENT_EN_V  0x00000001U
#define GPIOSD_ETM_CH0_EVENT_EN_S  7

/** GPIOSD_ETM_TASK_P0_CFG_REG register
 *  Etm Configure Register to decide which GPIO been chosen
 */
#define GPIOSD_ETM_TASK_P0_CFG_REG (DR_REG_GPIOSD_BASE + 0xa0)
/** GPIOSD_ETM_TASK_GPIO0_EN : R/W; bitpos: [0]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO0_EN    (BIT(0))
#define GPIOSD_ETM_TASK_GPIO0_EN_M  (GPIOSD_ETM_TASK_GPIO0_EN_V << GPIOSD_ETM_TASK_GPIO0_EN_S)
#define GPIOSD_ETM_TASK_GPIO0_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO0_EN_S  0
/** GPIOSD_ETM_TASK_GPIO0_SEL : R/W; bitpos: [3:1]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO0_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO0_SEL_M  (GPIOSD_ETM_TASK_GPIO0_SEL_V << GPIOSD_ETM_TASK_GPIO0_SEL_S)
#define GPIOSD_ETM_TASK_GPIO0_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO0_SEL_S  1
/** GPIOSD_ETM_TASK_GPIO1_EN : R/W; bitpos: [8]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO1_EN    (BIT(8))
#define GPIOSD_ETM_TASK_GPIO1_EN_M  (GPIOSD_ETM_TASK_GPIO1_EN_V << GPIOSD_ETM_TASK_GPIO1_EN_S)
#define GPIOSD_ETM_TASK_GPIO1_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO1_EN_S  8
/** GPIOSD_ETM_TASK_GPIO1_SEL : R/W; bitpos: [11:9]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO1_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO1_SEL_M  (GPIOSD_ETM_TASK_GPIO1_SEL_V << GPIOSD_ETM_TASK_GPIO1_SEL_S)
#define GPIOSD_ETM_TASK_GPIO1_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO1_SEL_S  9
/** GPIOSD_ETM_TASK_GPIO2_EN : R/W; bitpos: [16]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO2_EN    (BIT(16))
#define GPIOSD_ETM_TASK_GPIO2_EN_M  (GPIOSD_ETM_TASK_GPIO2_EN_V << GPIOSD_ETM_TASK_GPIO2_EN_S)
#define GPIOSD_ETM_TASK_GPIO2_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO2_EN_S  16
/** GPIOSD_ETM_TASK_GPIO2_SEL : R/W; bitpos: [19:17]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO2_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO2_SEL_M  (GPIOSD_ETM_TASK_GPIO2_SEL_V << GPIOSD_ETM_TASK_GPIO2_SEL_S)
#define GPIOSD_ETM_TASK_GPIO2_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO2_SEL_S  17
/** GPIOSD_ETM_TASK_GPIO3_EN : R/W; bitpos: [24]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO3_EN    (BIT(24))
#define GPIOSD_ETM_TASK_GPIO3_EN_M  (GPIOSD_ETM_TASK_GPIO3_EN_V << GPIOSD_ETM_TASK_GPIO3_EN_S)
#define GPIOSD_ETM_TASK_GPIO3_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO3_EN_S  24
/** GPIOSD_ETM_TASK_GPIO3_SEL : R/W; bitpos: [27:25]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO3_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO3_SEL_M  (GPIOSD_ETM_TASK_GPIO3_SEL_V << GPIOSD_ETM_TASK_GPIO3_SEL_S)
#define GPIOSD_ETM_TASK_GPIO3_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO3_SEL_S  25

/** GPIOSD_ETM_TASK_P1_CFG_REG register
 *  Etm Configure Register to decide which GPIO been chosen
 */
#define GPIOSD_ETM_TASK_P1_CFG_REG (DR_REG_GPIOSD_BASE + 0xa4)
/** GPIOSD_ETM_TASK_GPIO4_EN : R/W; bitpos: [0]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO4_EN    (BIT(0))
#define GPIOSD_ETM_TASK_GPIO4_EN_M  (GPIOSD_ETM_TASK_GPIO4_EN_V << GPIOSD_ETM_TASK_GPIO4_EN_S)
#define GPIOSD_ETM_TASK_GPIO4_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO4_EN_S  0
/** GPIOSD_ETM_TASK_GPIO4_SEL : R/W; bitpos: [3:1]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO4_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO4_SEL_M  (GPIOSD_ETM_TASK_GPIO4_SEL_V << GPIOSD_ETM_TASK_GPIO4_SEL_S)
#define GPIOSD_ETM_TASK_GPIO4_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO4_SEL_S  1
/** GPIOSD_ETM_TASK_GPIO5_EN : R/W; bitpos: [8]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO5_EN    (BIT(8))
#define GPIOSD_ETM_TASK_GPIO5_EN_M  (GPIOSD_ETM_TASK_GPIO5_EN_V << GPIOSD_ETM_TASK_GPIO5_EN_S)
#define GPIOSD_ETM_TASK_GPIO5_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO5_EN_S  8
/** GPIOSD_ETM_TASK_GPIO5_SEL : R/W; bitpos: [11:9]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO5_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO5_SEL_M  (GPIOSD_ETM_TASK_GPIO5_SEL_V << GPIOSD_ETM_TASK_GPIO5_SEL_S)
#define GPIOSD_ETM_TASK_GPIO5_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO5_SEL_S  9
/** GPIOSD_ETM_TASK_GPIO6_EN : R/W; bitpos: [16]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO6_EN    (BIT(16))
#define GPIOSD_ETM_TASK_GPIO6_EN_M  (GPIOSD_ETM_TASK_GPIO6_EN_V << GPIOSD_ETM_TASK_GPIO6_EN_S)
#define GPIOSD_ETM_TASK_GPIO6_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO6_EN_S  16
/** GPIOSD_ETM_TASK_GPIO6_SEL : R/W; bitpos: [19:17]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO6_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO6_SEL_M  (GPIOSD_ETM_TASK_GPIO6_SEL_V << GPIOSD_ETM_TASK_GPIO6_SEL_S)
#define GPIOSD_ETM_TASK_GPIO6_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO6_SEL_S  17
/** GPIOSD_ETM_TASK_GPIO7_EN : R/W; bitpos: [24]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO7_EN    (BIT(24))
#define GPIOSD_ETM_TASK_GPIO7_EN_M  (GPIOSD_ETM_TASK_GPIO7_EN_V << GPIOSD_ETM_TASK_GPIO7_EN_S)
#define GPIOSD_ETM_TASK_GPIO7_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO7_EN_S  24
/** GPIOSD_ETM_TASK_GPIO7_SEL : R/W; bitpos: [27:25]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO7_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO7_SEL_M  (GPIOSD_ETM_TASK_GPIO7_SEL_V << GPIOSD_ETM_TASK_GPIO7_SEL_S)
#define GPIOSD_ETM_TASK_GPIO7_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO7_SEL_S  25

/** GPIOSD_ETM_TASK_P2_CFG_REG register
 *  Etm Configure Register to decide which GPIO been chosen
 */
#define GPIOSD_ETM_TASK_P2_CFG_REG (DR_REG_GPIOSD_BASE + 0xa8)
/** GPIOSD_ETM_TASK_GPIO8_EN : R/W; bitpos: [0]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO8_EN    (BIT(0))
#define GPIOSD_ETM_TASK_GPIO8_EN_M  (GPIOSD_ETM_TASK_GPIO8_EN_V << GPIOSD_ETM_TASK_GPIO8_EN_S)
#define GPIOSD_ETM_TASK_GPIO8_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO8_EN_S  0
/** GPIOSD_ETM_TASK_GPIO8_SEL : R/W; bitpos: [3:1]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO8_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO8_SEL_M  (GPIOSD_ETM_TASK_GPIO8_SEL_V << GPIOSD_ETM_TASK_GPIO8_SEL_S)
#define GPIOSD_ETM_TASK_GPIO8_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO8_SEL_S  1
/** GPIOSD_ETM_TASK_GPIO9_EN : R/W; bitpos: [8]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO9_EN    (BIT(8))
#define GPIOSD_ETM_TASK_GPIO9_EN_M  (GPIOSD_ETM_TASK_GPIO9_EN_V << GPIOSD_ETM_TASK_GPIO9_EN_S)
#define GPIOSD_ETM_TASK_GPIO9_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO9_EN_S  8
/** GPIOSD_ETM_TASK_GPIO9_SEL : R/W; bitpos: [11:9]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO9_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO9_SEL_M  (GPIOSD_ETM_TASK_GPIO9_SEL_V << GPIOSD_ETM_TASK_GPIO9_SEL_S)
#define GPIOSD_ETM_TASK_GPIO9_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO9_SEL_S  9
/** GPIOSD_ETM_TASK_GPIO10_EN : R/W; bitpos: [16]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO10_EN    (BIT(16))
#define GPIOSD_ETM_TASK_GPIO10_EN_M  (GPIOSD_ETM_TASK_GPIO10_EN_V << GPIOSD_ETM_TASK_GPIO10_EN_S)
#define GPIOSD_ETM_TASK_GPIO10_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO10_EN_S  16
/** GPIOSD_ETM_TASK_GPIO10_SEL : R/W; bitpos: [19:17]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO10_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO10_SEL_M  (GPIOSD_ETM_TASK_GPIO10_SEL_V << GPIOSD_ETM_TASK_GPIO10_SEL_S)
#define GPIOSD_ETM_TASK_GPIO10_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO10_SEL_S  17
/** GPIOSD_ETM_TASK_GPIO11_EN : R/W; bitpos: [24]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO11_EN    (BIT(24))
#define GPIOSD_ETM_TASK_GPIO11_EN_M  (GPIOSD_ETM_TASK_GPIO11_EN_V << GPIOSD_ETM_TASK_GPIO11_EN_S)
#define GPIOSD_ETM_TASK_GPIO11_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO11_EN_S  24
/** GPIOSD_ETM_TASK_GPIO11_SEL : R/W; bitpos: [27:25]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO11_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO11_SEL_M  (GPIOSD_ETM_TASK_GPIO11_SEL_V << GPIOSD_ETM_TASK_GPIO11_SEL_S)
#define GPIOSD_ETM_TASK_GPIO11_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO11_SEL_S  25

