espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_sd_reg.h
/** GPIOSD_ETM_TASK_P3_CFG_REG register
 *  Etm Configure Register to decide which GPIO been chosen
 */
#define GPIOSD_ETM_TASK_P3_CFG_REG (DR_REG_GPIOSD_BASE + 0xac)
/** GPIOSD_ETM_TASK_GPIO12_EN : R/W; bitpos: [0]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO12_EN    (BIT(0))
#define GPIOSD_ETM_TASK_GPIO12_EN_M  (GPIOSD_ETM_TASK_GPIO12_EN_V << GPIOSD_ETM_TASK_GPIO12_EN_S)
#define GPIOSD_ETM_TASK_GPIO12_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO12_EN_S  0
/** GPIOSD_ETM_TASK_GPIO12_SEL : R/W; bitpos: [3:1]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO12_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO12_SEL_M  (GPIOSD_ETM_TASK_GPIO12_SEL_V << GPIOSD_ETM_TASK_GPIO12_SEL_S)
#define GPIOSD_ETM_TASK_GPIO12_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO12_SEL_S  1
/** GPIOSD_ETM_TASK_GPIO13_EN : R/W; bitpos: [8]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO13_EN    (BIT(8))
#define GPIOSD_ETM_TASK_GPIO13_EN_M  (GPIOSD_ETM_TASK_GPIO13_EN_V << GPIOSD_ETM_TASK_GPIO13_EN_S)
#define GPIOSD_ETM_TASK_GPIO13_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO13_EN_S  8
/** GPIOSD_ETM_TASK_GPIO13_SEL : R/W; bitpos: [11:9]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO13_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO13_SEL_M  (GPIOSD_ETM_TASK_GPIO13_SEL_V << GPIOSD_ETM_TASK_GPIO13_SEL_S)
#define GPIOSD_ETM_TASK_GPIO13_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO13_SEL_S  9
/** GPIOSD_ETM_TASK_GPIO14_EN : R/W; bitpos: [16]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO14_EN    (BIT(16))
#define GPIOSD_ETM_TASK_GPIO14_EN_M  (GPIOSD_ETM_TASK_GPIO14_EN_V << GPIOSD_ETM_TASK_GPIO14_EN_S)
#define GPIOSD_ETM_TASK_GPIO14_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO14_EN_S  16
/** GPIOSD_ETM_TASK_GPIO14_SEL : R/W; bitpos: [19:17]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO14_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO14_SEL_M  (GPIOSD_ETM_TASK_GPIO14_SEL_V << GPIOSD_ETM_TASK_GPIO14_SEL_S)
#define GPIOSD_ETM_TASK_GPIO14_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO14_SEL_S  17
/** GPIOSD_ETM_TASK_GPIO15_EN : R/W; bitpos: [24]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO15_EN    (BIT(24))
#define GPIOSD_ETM_TASK_GPIO15_EN_M  (GPIOSD_ETM_TASK_GPIO15_EN_V << GPIOSD_ETM_TASK_GPIO15_EN_S)
#define GPIOSD_ETM_TASK_GPIO15_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO15_EN_S  24
/** GPIOSD_ETM_TASK_GPIO15_SEL : R/W; bitpos: [27:25]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO15_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO15_SEL_M  (GPIOSD_ETM_TASK_GPIO15_SEL_V << GPIOSD_ETM_TASK_GPIO15_SEL_S)
#define GPIOSD_ETM_TASK_GPIO15_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO15_SEL_S  25

/** GPIOSD_ETM_TASK_P4_CFG_REG register
 *  Etm Configure Register to decide which GPIO been chosen
 */
#define GPIOSD_ETM_TASK_P4_CFG_REG (DR_REG_GPIOSD_BASE + 0xb0)
/** GPIOSD_ETM_TASK_GPIO16_EN : R/W; bitpos: [0]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO16_EN    (BIT(0))
#define GPIOSD_ETM_TASK_GPIO16_EN_M  (GPIOSD_ETM_TASK_GPIO16_EN_V << GPIOSD_ETM_TASK_GPIO16_EN_S)
#define GPIOSD_ETM_TASK_GPIO16_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO16_EN_S  0
/** GPIOSD_ETM_TASK_GPIO16_SEL : R/W; bitpos: [3:1]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO16_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO16_SEL_M  (GPIOSD_ETM_TASK_GPIO16_SEL_V << GPIOSD_ETM_TASK_GPIO16_SEL_S)
#define GPIOSD_ETM_TASK_GPIO16_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO16_SEL_S  1
/** GPIOSD_ETM_TASK_GPIO17_EN : R/W; bitpos: [8]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO17_EN    (BIT(8))
#define GPIOSD_ETM_TASK_GPIO17_EN_M  (GPIOSD_ETM_TASK_GPIO17_EN_V << GPIOSD_ETM_TASK_GPIO17_EN_S)
#define GPIOSD_ETM_TASK_GPIO17_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO17_EN_S  8
/** GPIOSD_ETM_TASK_GPIO17_SEL : R/W; bitpos: [11:9]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO17_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO17_SEL_M  (GPIOSD_ETM_TASK_GPIO17_SEL_V << GPIOSD_ETM_TASK_GPIO17_SEL_S)
#define GPIOSD_ETM_TASK_GPIO17_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO17_SEL_S  9
/** GPIOSD_ETM_TASK_GPIO18_EN : R/W; bitpos: [16]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO18_EN    (BIT(16))
#define GPIOSD_ETM_TASK_GPIO18_EN_M  (GPIOSD_ETM_TASK_GPIO18_EN_V << GPIOSD_ETM_TASK_GPIO18_EN_S)
#define GPIOSD_ETM_TASK_GPIO18_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO18_EN_S  16
/** GPIOSD_ETM_TASK_GPIO18_SEL : R/W; bitpos: [19:17]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO18_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO18_SEL_M  (GPIOSD_ETM_TASK_GPIO18_SEL_V << GPIOSD_ETM_TASK_GPIO18_SEL_S)
#define GPIOSD_ETM_TASK_GPIO18_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO18_SEL_S  17
/** GPIOSD_ETM_TASK_GPIO19_EN : R/W; bitpos: [24]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO19_EN    (BIT(24))
#define GPIOSD_ETM_TASK_GPIO19_EN_M  (GPIOSD_ETM_TASK_GPIO19_EN_V << GPIOSD_ETM_TASK_GPIO19_EN_S)
#define GPIOSD_ETM_TASK_GPIO19_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO19_EN_S  24
/** GPIOSD_ETM_TASK_GPIO19_SEL : R/W; bitpos: [27:25]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO19_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO19_SEL_M  (GPIOSD_ETM_TASK_GPIO19_SEL_V << GPIOSD_ETM_TASK_GPIO19_SEL_S)
#define GPIOSD_ETM_TASK_GPIO19_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO19_SEL_S  25

/** GPIOSD_ETM_TASK_P5_CFG_REG register
 *  Etm Configure Register to decide which GPIO been chosen
 */
#define GPIOSD_ETM_TASK_P5_CFG_REG (DR_REG_GPIOSD_BASE + 0xb4)
/** GPIOSD_ETM_TASK_GPIO20_EN : R/W; bitpos: [0]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO20_EN    (BIT(0))
#define GPIOSD_ETM_TASK_GPIO20_EN_M  (GPIOSD_ETM_TASK_GPIO20_EN_V << GPIOSD_ETM_TASK_GPIO20_EN_S)
#define GPIOSD_ETM_TASK_GPIO20_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO20_EN_S  0
/** GPIOSD_ETM_TASK_GPIO20_SEL : R/W; bitpos: [3:1]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO20_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO20_SEL_M  (GPIOSD_ETM_TASK_GPIO20_SEL_V << GPIOSD_ETM_TASK_GPIO20_SEL_S)
#define GPIOSD_ETM_TASK_GPIO20_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO20_SEL_S  1
/** GPIOSD_ETM_TASK_GPIO21_EN : R/W; bitpos: [8]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO21_EN    (BIT(8))
#define GPIOSD_ETM_TASK_GPIO21_EN_M  (GPIOSD_ETM_TASK_GPIO21_EN_V << GPIOSD_ETM_TASK_GPIO21_EN_S)
#define GPIOSD_ETM_TASK_GPIO21_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO21_EN_S  8
/** GPIOSD_ETM_TASK_GPIO21_SEL : R/W; bitpos: [11:9]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO21_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO21_SEL_M  (GPIOSD_ETM_TASK_GPIO21_SEL_V << GPIOSD_ETM_TASK_GPIO21_SEL_S)
#define GPIOSD_ETM_TASK_GPIO21_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO21_SEL_S  9
/** GPIOSD_ETM_TASK_GPIO22_EN : R/W; bitpos: [16]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO22_EN    (BIT(16))
#define GPIOSD_ETM_TASK_GPIO22_EN_M  (GPIOSD_ETM_TASK_GPIO22_EN_V << GPIOSD_ETM_TASK_GPIO22_EN_S)
#define GPIOSD_ETM_TASK_GPIO22_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO22_EN_S  16
/** GPIOSD_ETM_TASK_GPIO22_SEL : R/W; bitpos: [19:17]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO22_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO22_SEL_M  (GPIOSD_ETM_TASK_GPIO22_SEL_V << GPIOSD_ETM_TASK_GPIO22_SEL_S)
#define GPIOSD_ETM_TASK_GPIO22_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO22_SEL_S  17
/** GPIOSD_ETM_TASK_GPIO23_EN : R/W; bitpos: [24]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO23_EN    (BIT(24))
#define GPIOSD_ETM_TASK_GPIO23_EN_M  (GPIOSD_ETM_TASK_GPIO23_EN_V << GPIOSD_ETM_TASK_GPIO23_EN_S)
#define GPIOSD_ETM_TASK_GPIO23_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO23_EN_S  24
/** GPIOSD_ETM_TASK_GPIO23_SEL : R/W; bitpos: [27:25]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO23_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO23_SEL_M  (GPIOSD_ETM_TASK_GPIO23_SEL_V << GPIOSD_ETM_TASK_GPIO23_SEL_S)
#define GPIOSD_ETM_TASK_GPIO23_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO23_SEL_S  25

/** GPIOSD_ETM_TASK_P6_CFG_REG register
 *  Etm Configure Register to decide which GPIO been chosen
 */
#define GPIOSD_ETM_TASK_P6_CFG_REG (DR_REG_GPIOSD_BASE + 0xb8)
/** GPIOSD_ETM_TASK_GPIO24_EN : R/W; bitpos: [0]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO24_EN    (BIT(0))
#define GPIOSD_ETM_TASK_GPIO24_EN_M  (GPIOSD_ETM_TASK_GPIO24_EN_V << GPIOSD_ETM_TASK_GPIO24_EN_S)
#define GPIOSD_ETM_TASK_GPIO24_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO24_EN_S  0
/** GPIOSD_ETM_TASK_GPIO24_SEL : R/W; bitpos: [3:1]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO24_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO24_SEL_M  (GPIOSD_ETM_TASK_GPIO24_SEL_V << GPIOSD_ETM_TASK_GPIO24_SEL_S)
#define GPIOSD_ETM_TASK_GPIO24_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO24_SEL_S  1
/** GPIOSD_ETM_TASK_GPIO25_EN : R/W; bitpos: [8]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO25_EN    (BIT(8))
#define GPIOSD_ETM_TASK_GPIO25_EN_M  (GPIOSD_ETM_TASK_GPIO25_EN_V << GPIOSD_ETM_TASK_GPIO25_EN_S)
#define GPIOSD_ETM_TASK_GPIO25_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO25_EN_S  8
/** GPIOSD_ETM_TASK_GPIO25_SEL : R/W; bitpos: [11:9]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO25_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO25_SEL_M  (GPIOSD_ETM_TASK_GPIO25_SEL_V << GPIOSD_ETM_TASK_GPIO25_SEL_S)
#define GPIOSD_ETM_TASK_GPIO25_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO25_SEL_S  9
/** GPIOSD_ETM_TASK_GPIO26_EN : R/W; bitpos: [16]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO26_EN    (BIT(16))
#define GPIOSD_ETM_TASK_GPIO26_EN_M  (GPIOSD_ETM_TASK_GPIO26_EN_V << GPIOSD_ETM_TASK_GPIO26_EN_S)
#define GPIOSD_ETM_TASK_GPIO26_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO26_EN_S  16
/** GPIOSD_ETM_TASK_GPIO26_SEL : R/W; bitpos: [19:17]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO26_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO26_SEL_M  (GPIOSD_ETM_TASK_GPIO26_SEL_V << GPIOSD_ETM_TASK_GPIO26_SEL_S)
#define GPIOSD_ETM_TASK_GPIO26_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO26_SEL_S  17
/** GPIOSD_ETM_TASK_GPIO27_EN : R/W; bitpos: [24]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO27_EN    (BIT(24))
#define GPIOSD_ETM_TASK_GPIO27_EN_M  (GPIOSD_ETM_TASK_GPIO27_EN_V << GPIOSD_ETM_TASK_GPIO27_EN_S)
#define GPIOSD_ETM_TASK_GPIO27_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO27_EN_S  24
/** GPIOSD_ETM_TASK_GPIO27_SEL : R/W; bitpos: [27:25]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO27_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO27_SEL_M  (GPIOSD_ETM_TASK_GPIO27_SEL_V << GPIOSD_ETM_TASK_GPIO27_SEL_S)
#define GPIOSD_ETM_TASK_GPIO27_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO27_SEL_S  25

/** GPIOSD_ETM_TASK_P7_CFG_REG register
 *  Etm Configure Register to decide which GPIO been chosen
 */
#define GPIOSD_ETM_TASK_P7_CFG_REG (DR_REG_GPIOSD_BASE + 0xbc)
/** GPIOSD_ETM_TASK_GPIO28_EN : R/W; bitpos: [0]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO28_EN    (BIT(0))
#define GPIOSD_ETM_TASK_GPIO28_EN_M  (GPIOSD_ETM_TASK_GPIO28_EN_V << GPIOSD_ETM_TASK_GPIO28_EN_S)
#define GPIOSD_ETM_TASK_GPIO28_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO28_EN_S  0
/** GPIOSD_ETM_TASK_GPIO28_SEL : R/W; bitpos: [3:1]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO28_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO28_SEL_M  (GPIOSD_ETM_TASK_GPIO28_SEL_V << GPIOSD_ETM_TASK_GPIO28_SEL_S)
#define GPIOSD_ETM_TASK_GPIO28_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO28_SEL_S  1
/** GPIOSD_ETM_TASK_GPIO29_EN : R/W; bitpos: [8]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO29_EN    (BIT(8))
#define GPIOSD_ETM_TASK_GPIO29_EN_M  (GPIOSD_ETM_TASK_GPIO29_EN_V << GPIOSD_ETM_TASK_GPIO29_EN_S)
#define GPIOSD_ETM_TASK_GPIO29_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO29_EN_S  8
/** GPIOSD_ETM_TASK_GPIO29_SEL : R/W; bitpos: [11:9]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO29_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO29_SEL_M  (GPIOSD_ETM_TASK_GPIO29_SEL_V << GPIOSD_ETM_TASK_GPIO29_SEL_S)
#define GPIOSD_ETM_TASK_GPIO29_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO29_SEL_S  9
/** GPIOSD_ETM_TASK_GPIO30_EN : R/W; bitpos: [16]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO30_EN    (BIT(16))
#define GPIOSD_ETM_TASK_GPIO30_EN_M  (GPIOSD_ETM_TASK_GPIO30_EN_V << GPIOSD_ETM_TASK_GPIO30_EN_S)
#define GPIOSD_ETM_TASK_GPIO30_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO30_EN_S  16
/** GPIOSD_ETM_TASK_GPIO30_SEL : R/W; bitpos: [19:17]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO30_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO30_SEL_M  (GPIOSD_ETM_TASK_GPIO30_SEL_V << GPIOSD_ETM_TASK_GPIO30_SEL_S)
#define GPIOSD_ETM_TASK_GPIO30_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO30_SEL_S  17
/** GPIOSD_ETM_TASK_GPIO31_EN : R/W; bitpos: [24]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO31_EN    (BIT(24))
#define GPIOSD_ETM_TASK_GPIO31_EN_M  (GPIOSD_ETM_TASK_GPIO31_EN_V << GPIOSD_ETM_TASK_GPIO31_EN_S)
#define GPIOSD_ETM_TASK_GPIO31_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO31_EN_S  24
/** GPIOSD_ETM_TASK_GPIO31_SEL : R/W; bitpos: [27:25]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO31_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO31_SEL_M  (GPIOSD_ETM_TASK_GPIO31_SEL_V << GPIOSD_ETM_TASK_GPIO31_SEL_S)
#define GPIOSD_ETM_TASK_GPIO31_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO31_SEL_S  25

/** GPIOSD_ETM_TASK_P8_CFG_REG register
 *  Etm Configure Register to decide which GPIO been chosen
 */
#define GPIOSD_ETM_TASK_P8_CFG_REG (DR_REG_GPIOSD_BASE + 0xc0)
/** GPIOSD_ETM_TASK_GPIO32_EN : R/W; bitpos: [0]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO32_EN    (BIT(0))
#define GPIOSD_ETM_TASK_GPIO32_EN_M  (GPIOSD_ETM_TASK_GPIO32_EN_V << GPIOSD_ETM_TASK_GPIO32_EN_S)
#define GPIOSD_ETM_TASK_GPIO32_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO32_EN_S  0
/** GPIOSD_ETM_TASK_GPIO32_SEL : R/W; bitpos: [3:1]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO32_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO32_SEL_M  (GPIOSD_ETM_TASK_GPIO32_SEL_V << GPIOSD_ETM_TASK_GPIO32_SEL_S)
#define GPIOSD_ETM_TASK_GPIO32_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO32_SEL_S  1
/** GPIOSD_ETM_TASK_GPIO33_EN : R/W; bitpos: [8]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO33_EN    (BIT(8))
#define GPIOSD_ETM_TASK_GPIO33_EN_M  (GPIOSD_ETM_TASK_GPIO33_EN_V << GPIOSD_ETM_TASK_GPIO33_EN_S)
#define GPIOSD_ETM_TASK_GPIO33_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO33_EN_S  8
/** GPIOSD_ETM_TASK_GPIO33_SEL : R/W; bitpos: [11:9]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO33_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO33_SEL_M  (GPIOSD_ETM_TASK_GPIO33_SEL_V << GPIOSD_ETM_TASK_GPIO33_SEL_S)
#define GPIOSD_ETM_TASK_GPIO33_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO33_SEL_S  9
/** GPIOSD_ETM_TASK_GPIO34_EN : R/W; bitpos: [16]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO34_EN    (BIT(16))
#define GPIOSD_ETM_TASK_GPIO34_EN_M  (GPIOSD_ETM_TASK_GPIO34_EN_V << GPIOSD_ETM_TASK_GPIO34_EN_S)
#define GPIOSD_ETM_TASK_GPIO34_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO34_EN_S  16
/** GPIOSD_ETM_TASK_GPIO34_SEL : R/W; bitpos: [19:17]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO34_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO34_SEL_M  (GPIOSD_ETM_TASK_GPIO34_SEL_V << GPIOSD_ETM_TASK_GPIO34_SEL_S)
#define GPIOSD_ETM_TASK_GPIO34_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO34_SEL_S  17
/** GPIOSD_ETM_TASK_GPIO35_EN : R/W; bitpos: [24]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO35_EN    (BIT(24))
#define GPIOSD_ETM_TASK_GPIO35_EN_M  (GPIOSD_ETM_TASK_GPIO35_EN_V << GPIOSD_ETM_TASK_GPIO35_EN_S)
#define GPIOSD_ETM_TASK_GPIO35_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO35_EN_S  24
/** GPIOSD_ETM_TASK_GPIO35_SEL : R/W; bitpos: [27:25]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO35_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO35_SEL_M  (GPIOSD_ETM_TASK_GPIO35_SEL_V << GPIOSD_ETM_TASK_GPIO35_SEL_S)
#define GPIOSD_ETM_TASK_GPIO35_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO35_SEL_S  25

/** GPIOSD_ETM_TASK_P9_CFG_REG register
 *  Etm Configure Register to decide which GPIO been chosen
 */
#define GPIOSD_ETM_TASK_P9_CFG_REG (DR_REG_GPIOSD_BASE + 0xc4)
/** GPIOSD_ETM_TASK_GPIO36_EN : R/W; bitpos: [0]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO36_EN    (BIT(0))
#define GPIOSD_ETM_TASK_GPIO36_EN_M  (GPIOSD_ETM_TASK_GPIO36_EN_V << GPIOSD_ETM_TASK_GPIO36_EN_S)
#define GPIOSD_ETM_TASK_GPIO36_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO36_EN_S  0
/** GPIOSD_ETM_TASK_GPIO36_SEL : R/W; bitpos: [3:1]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO36_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO36_SEL_M  (GPIOSD_ETM_TASK_GPIO36_SEL_V << GPIOSD_ETM_TASK_GPIO36_SEL_S)
#define GPIOSD_ETM_TASK_GPIO36_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO36_SEL_S  1
/** GPIOSD_ETM_TASK_GPIO37_EN : R/W; bitpos: [8]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO37_EN    (BIT(8))
#define GPIOSD_ETM_TASK_GPIO37_EN_M  (GPIOSD_ETM_TASK_GPIO37_EN_V << GPIOSD_ETM_TASK_GPIO37_EN_S)
#define GPIOSD_ETM_TASK_GPIO37_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO37_EN_S  8
/** GPIOSD_ETM_TASK_GPIO37_SEL : R/W; bitpos: [11:9]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO37_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO37_SEL_M  (GPIOSD_ETM_TASK_GPIO37_SEL_V << GPIOSD_ETM_TASK_GPIO37_SEL_S)
#define GPIOSD_ETM_TASK_GPIO37_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO37_SEL_S  9
/** GPIOSD_ETM_TASK_GPIO38_EN : R/W; bitpos: [16]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO38_EN    (BIT(16))
#define GPIOSD_ETM_TASK_GPIO38_EN_M  (GPIOSD_ETM_TASK_GPIO38_EN_V << GPIOSD_ETM_TASK_GPIO38_EN_S)
#define GPIOSD_ETM_TASK_GPIO38_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO38_EN_S  16
/** GPIOSD_ETM_TASK_GPIO38_SEL : R/W; bitpos: [19:17]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO38_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO38_SEL_M  (GPIOSD_ETM_TASK_GPIO38_SEL_V << GPIOSD_ETM_TASK_GPIO38_SEL_S)
#define GPIOSD_ETM_TASK_GPIO38_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO38_SEL_S  17
/** GPIOSD_ETM_TASK_GPIO39_EN : R/W; bitpos: [24]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO39_EN    (BIT(24))
#define GPIOSD_ETM_TASK_GPIO39_EN_M  (GPIOSD_ETM_TASK_GPIO39_EN_V << GPIOSD_ETM_TASK_GPIO39_EN_S)
#define GPIOSD_ETM_TASK_GPIO39_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO39_EN_S  24
/** GPIOSD_ETM_TASK_GPIO39_SEL : R/W; bitpos: [27:25]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO39_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO39_SEL_M  (GPIOSD_ETM_TASK_GPIO39_SEL_V << GPIOSD_ETM_TASK_GPIO39_SEL_S)
#define GPIOSD_ETM_TASK_GPIO39_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO39_SEL_S  25

