espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_sd_reg.h
/** GPIOSD_ETM_TASK_P10_CFG_REG register
 *  Etm Configure Register to decide which GPIO been chosen
 */
#define GPIOSD_ETM_TASK_P10_CFG_REG (DR_REG_GPIOSD_BASE + 0xc8)
/** GPIOSD_ETM_TASK_GPIO40_EN : R/W; bitpos: [0]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO40_EN    (BIT(0))
#define GPIOSD_ETM_TASK_GPIO40_EN_M  (GPIOSD_ETM_TASK_GPIO40_EN_V << GPIOSD_ETM_TASK_GPIO40_EN_S)
#define GPIOSD_ETM_TASK_GPIO40_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO40_EN_S  0
/** GPIOSD_ETM_TASK_GPIO40_SEL : R/W; bitpos: [3:1]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO40_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO40_SEL_M  (GPIOSD_ETM_TASK_GPIO40_SEL_V << GPIOSD_ETM_TASK_GPIO40_SEL_S)
#define GPIOSD_ETM_TASK_GPIO40_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO40_SEL_S  1
/** GPIOSD_ETM_TASK_GPIO41_EN : R/W; bitpos: [8]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO41_EN    (BIT(8))
#define GPIOSD_ETM_TASK_GPIO41_EN_M  (GPIOSD_ETM_TASK_GPIO41_EN_V << GPIOSD_ETM_TASK_GPIO41_EN_S)
#define GPIOSD_ETM_TASK_GPIO41_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO41_EN_S  8
/** GPIOSD_ETM_TASK_GPIO41_SEL : R/W; bitpos: [11:9]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO41_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO41_SEL_M  (GPIOSD_ETM_TASK_GPIO41_SEL_V << GPIOSD_ETM_TASK_GPIO41_SEL_S)
#define GPIOSD_ETM_TASK_GPIO41_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO41_SEL_S  9
/** GPIOSD_ETM_TASK_GPIO42_EN : R/W; bitpos: [16]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO42_EN    (BIT(16))
#define GPIOSD_ETM_TASK_GPIO42_EN_M  (GPIOSD_ETM_TASK_GPIO42_EN_V << GPIOSD_ETM_TASK_GPIO42_EN_S)
#define GPIOSD_ETM_TASK_GPIO42_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO42_EN_S  16
/** GPIOSD_ETM_TASK_GPIO42_SEL : R/W; bitpos: [19:17]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO42_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO42_SEL_M  (GPIOSD_ETM_TASK_GPIO42_SEL_V << GPIOSD_ETM_TASK_GPIO42_SEL_S)
#define GPIOSD_ETM_TASK_GPIO42_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO42_SEL_S  17
/** GPIOSD_ETM_TASK_GPIO43_EN : R/W; bitpos: [24]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO43_EN    (BIT(24))
#define GPIOSD_ETM_TASK_GPIO43_EN_M  (GPIOSD_ETM_TASK_GPIO43_EN_V << GPIOSD_ETM_TASK_GPIO43_EN_S)
#define GPIOSD_ETM_TASK_GPIO43_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO43_EN_S  24
/** GPIOSD_ETM_TASK_GPIO43_SEL : R/W; bitpos: [27:25]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO43_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO43_SEL_M  (GPIOSD_ETM_TASK_GPIO43_SEL_V << GPIOSD_ETM_TASK_GPIO43_SEL_S)
#define GPIOSD_ETM_TASK_GPIO43_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO43_SEL_S  25

/** GPIOSD_ETM_TASK_P11_CFG_REG register
 *  Etm Configure Register to decide which GPIO been chosen
 */
#define GPIOSD_ETM_TASK_P11_CFG_REG (DR_REG_GPIOSD_BASE + 0xcc)
/** GPIOSD_ETM_TASK_GPIO44_EN : R/W; bitpos: [0]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO44_EN    (BIT(0))
#define GPIOSD_ETM_TASK_GPIO44_EN_M  (GPIOSD_ETM_TASK_GPIO44_EN_V << GPIOSD_ETM_TASK_GPIO44_EN_S)
#define GPIOSD_ETM_TASK_GPIO44_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO44_EN_S  0
/** GPIOSD_ETM_TASK_GPIO44_SEL : R/W; bitpos: [3:1]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO44_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO44_SEL_M  (GPIOSD_ETM_TASK_GPIO44_SEL_V << GPIOSD_ETM_TASK_GPIO44_SEL_S)
#define GPIOSD_ETM_TASK_GPIO44_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO44_SEL_S  1
/** GPIOSD_ETM_TASK_GPIO45_EN : R/W; bitpos: [8]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO45_EN    (BIT(8))
#define GPIOSD_ETM_TASK_GPIO45_EN_M  (GPIOSD_ETM_TASK_GPIO45_EN_V << GPIOSD_ETM_TASK_GPIO45_EN_S)
#define GPIOSD_ETM_TASK_GPIO45_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO45_EN_S  8
/** GPIOSD_ETM_TASK_GPIO45_SEL : R/W; bitpos: [11:9]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO45_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO45_SEL_M  (GPIOSD_ETM_TASK_GPIO45_SEL_V << GPIOSD_ETM_TASK_GPIO45_SEL_S)
#define GPIOSD_ETM_TASK_GPIO45_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO45_SEL_S  9
/** GPIOSD_ETM_TASK_GPIO46_EN : R/W; bitpos: [16]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO46_EN    (BIT(16))
#define GPIOSD_ETM_TASK_GPIO46_EN_M  (GPIOSD_ETM_TASK_GPIO46_EN_V << GPIOSD_ETM_TASK_GPIO46_EN_S)
#define GPIOSD_ETM_TASK_GPIO46_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO46_EN_S  16
/** GPIOSD_ETM_TASK_GPIO46_SEL : R/W; bitpos: [19:17]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO46_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO46_SEL_M  (GPIOSD_ETM_TASK_GPIO46_SEL_V << GPIOSD_ETM_TASK_GPIO46_SEL_S)
#define GPIOSD_ETM_TASK_GPIO46_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO46_SEL_S  17
/** GPIOSD_ETM_TASK_GPIO47_EN : R/W; bitpos: [24]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO47_EN    (BIT(24))
#define GPIOSD_ETM_TASK_GPIO47_EN_M  (GPIOSD_ETM_TASK_GPIO47_EN_V << GPIOSD_ETM_TASK_GPIO47_EN_S)
#define GPIOSD_ETM_TASK_GPIO47_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO47_EN_S  24
/** GPIOSD_ETM_TASK_GPIO47_SEL : R/W; bitpos: [27:25]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO47_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO47_SEL_M  (GPIOSD_ETM_TASK_GPIO47_SEL_V << GPIOSD_ETM_TASK_GPIO47_SEL_S)
#define GPIOSD_ETM_TASK_GPIO47_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO47_SEL_S  25

/** GPIOSD_ETM_TASK_P12_CFG_REG register
 *  Etm Configure Register to decide which GPIO been chosen
 */
#define GPIOSD_ETM_TASK_P12_CFG_REG (DR_REG_GPIOSD_BASE + 0xd0)
/** GPIOSD_ETM_TASK_GPIO48_EN : R/W; bitpos: [0]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO48_EN    (BIT(0))
#define GPIOSD_ETM_TASK_GPIO48_EN_M  (GPIOSD_ETM_TASK_GPIO48_EN_V << GPIOSD_ETM_TASK_GPIO48_EN_S)
#define GPIOSD_ETM_TASK_GPIO48_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO48_EN_S  0
/** GPIOSD_ETM_TASK_GPIO48_SEL : R/W; bitpos: [3:1]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO48_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO48_SEL_M  (GPIOSD_ETM_TASK_GPIO48_SEL_V << GPIOSD_ETM_TASK_GPIO48_SEL_S)
#define GPIOSD_ETM_TASK_GPIO48_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO48_SEL_S  1
/** GPIOSD_ETM_TASK_GPIO49_EN : R/W; bitpos: [8]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO49_EN    (BIT(8))
#define GPIOSD_ETM_TASK_GPIO49_EN_M  (GPIOSD_ETM_TASK_GPIO49_EN_V << GPIOSD_ETM_TASK_GPIO49_EN_S)
#define GPIOSD_ETM_TASK_GPIO49_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO49_EN_S  8
/** GPIOSD_ETM_TASK_GPIO49_SEL : R/W; bitpos: [11:9]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO49_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO49_SEL_M  (GPIOSD_ETM_TASK_GPIO49_SEL_V << GPIOSD_ETM_TASK_GPIO49_SEL_S)
#define GPIOSD_ETM_TASK_GPIO49_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO49_SEL_S  9
/** GPIOSD_ETM_TASK_GPIO50_EN : R/W; bitpos: [16]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO50_EN    (BIT(16))
#define GPIOSD_ETM_TASK_GPIO50_EN_M  (GPIOSD_ETM_TASK_GPIO50_EN_V << GPIOSD_ETM_TASK_GPIO50_EN_S)
#define GPIOSD_ETM_TASK_GPIO50_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO50_EN_S  16
/** GPIOSD_ETM_TASK_GPIO50_SEL : R/W; bitpos: [19:17]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO50_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO50_SEL_M  (GPIOSD_ETM_TASK_GPIO50_SEL_V << GPIOSD_ETM_TASK_GPIO50_SEL_S)
#define GPIOSD_ETM_TASK_GPIO50_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO50_SEL_S  17
/** GPIOSD_ETM_TASK_GPIO51_EN : R/W; bitpos: [24]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO51_EN    (BIT(24))
#define GPIOSD_ETM_TASK_GPIO51_EN_M  (GPIOSD_ETM_TASK_GPIO51_EN_V << GPIOSD_ETM_TASK_GPIO51_EN_S)
#define GPIOSD_ETM_TASK_GPIO51_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO51_EN_S  24
/** GPIOSD_ETM_TASK_GPIO51_SEL : R/W; bitpos: [27:25]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO51_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO51_SEL_M  (GPIOSD_ETM_TASK_GPIO51_SEL_V << GPIOSD_ETM_TASK_GPIO51_SEL_S)
#define GPIOSD_ETM_TASK_GPIO51_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO51_SEL_S  25

/** GPIOSD_ETM_TASK_P13_CFG_REG register
 *  Etm Configure Register to decide which GPIO been chosen
 */
#define GPIOSD_ETM_TASK_P13_CFG_REG (DR_REG_GPIOSD_BASE + 0xd4)
/** GPIOSD_ETM_TASK_GPIO52_EN : R/W; bitpos: [0]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO52_EN    (BIT(0))
#define GPIOSD_ETM_TASK_GPIO52_EN_M  (GPIOSD_ETM_TASK_GPIO52_EN_V << GPIOSD_ETM_TASK_GPIO52_EN_S)
#define GPIOSD_ETM_TASK_GPIO52_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO52_EN_S  0
/** GPIOSD_ETM_TASK_GPIO52_SEL : R/W; bitpos: [3:1]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO52_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO52_SEL_M  (GPIOSD_ETM_TASK_GPIO52_SEL_V << GPIOSD_ETM_TASK_GPIO52_SEL_S)
#define GPIOSD_ETM_TASK_GPIO52_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO52_SEL_S  1
/** GPIOSD_ETM_TASK_GPIO53_EN : R/W; bitpos: [8]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO53_EN    (BIT(8))
#define GPIOSD_ETM_TASK_GPIO53_EN_M  (GPIOSD_ETM_TASK_GPIO53_EN_V << GPIOSD_ETM_TASK_GPIO53_EN_S)
#define GPIOSD_ETM_TASK_GPIO53_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO53_EN_S  8
/** GPIOSD_ETM_TASK_GPIO53_SEL : R/W; bitpos: [11:9]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO53_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO53_SEL_M  (GPIOSD_ETM_TASK_GPIO53_SEL_V << GPIOSD_ETM_TASK_GPIO53_SEL_S)
#define GPIOSD_ETM_TASK_GPIO53_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO53_SEL_S  9
/** GPIOSD_ETM_TASK_GPIO54_EN : R/W; bitpos: [16]; default: 0;
 *  Enable bit of GPIO response etm task.
 */
#define GPIOSD_ETM_TASK_GPIO54_EN    (BIT(16))
#define GPIOSD_ETM_TASK_GPIO54_EN_M  (GPIOSD_ETM_TASK_GPIO54_EN_V << GPIOSD_ETM_TASK_GPIO54_EN_S)
#define GPIOSD_ETM_TASK_GPIO54_EN_V  0x00000001U
#define GPIOSD_ETM_TASK_GPIO54_EN_S  16
/** GPIOSD_ETM_TASK_GPIO54_SEL : R/W; bitpos: [19:17]; default: 0;
 *  GPIO choose a etm task channel.
 */
#define GPIOSD_ETM_TASK_GPIO54_SEL    0x00000007U
#define GPIOSD_ETM_TASK_GPIO54_SEL_M  (GPIOSD_ETM_TASK_GPIO54_SEL_V << GPIOSD_ETM_TASK_GPIO54_SEL_S)
#define GPIOSD_ETM_TASK_GPIO54_SEL_V  0x00000007U
#define GPIOSD_ETM_TASK_GPIO54_SEL_S  17

/** GPIOSD_VERSION_REG register
 *  Version Control Register
 */
#define GPIOSD_VERSION_REG (DR_REG_GPIOSD_BASE + 0xfc)
/** GPIOSD_GPIO_SD_DATE : R/W; bitpos: [27:0]; default: 35663952;
 *  Version control register.
 */
#define GPIOSD_GPIO_SD_DATE    0x0FFFFFFFU
#define GPIOSD_GPIO_SD_DATE_M  (GPIOSD_GPIO_SD_DATE_V << GPIOSD_GPIO_SD_DATE_S)
#define GPIOSD_GPIO_SD_DATE_V  0x0FFFFFFFU
#define GPIOSD_GPIO_SD_DATE_S  0

#ifdef __cplusplus
}
#endif
